[
  {
    "id": "1",
    "text": "A banana is a yellow fruit that is soft and sweet.",
    "region": "Tropical",
    "type": "Fruit"
  },
  {
    "id": "2",
    "text": "A lemon is yellow and very sour.",
    "region": "Tropical",
    "type": "Fruit"
  },
  {
    "id": "3",
    "text": "A chili pepper is red and extremely spicy.",
    "region": "Various",
    "type": "Spice"
  },
  {
    "id": "4",
    "text": "An apple can be red, green, or yellow and has a sweet taste.",
    "region": "Global",
    "type": "Fruit"
  },
  {
    "id": "5",
    "text": "Biryani is a flavorful Indian rice dish made with spices, rice, and usually meat or vegetables.",
    "region": "Hyderabad",
    "type": "Main Course"
  },
  {
    "id": "6",
    "text": "Samosa is a fried or baked pastry with a spicy potato filling, popular as a snack in India.",
    "region": "North India",
    "type": "Snack"
  },
  {
    "id": "7",
    "text": "Paneer butter masala is a creamy tomato-based curry made with Indian cottage cheese.",
    "region": "Punjab",
    "type": "Main Course"
  },
  {
    "id": "8",
    "text": "Masala dosa is a thin, crispy fermented crepe filled with spicy mashed potatoes.",
    "region": "South India",
    "type": "Breakfast"
  },
  {
    "id": "9",
    "text": "Chole is a spicy chickpea curry from North India, often eaten with rice or bhature.",
    "region": "North India",
    "type": "Main Course"
  },
  {
    "id": "10",
    "text": "Rasgulla is a spongy dessert made from ball-shaped dumplings of chhena cooked in light syrup.",
    "region": "Bengal",
    "type": "Dessert"
  },
  {
    "id": "11",
    "text": "Naan is a soft and fluffy flatbread that is traditionally baked in a tandoor.",
    "region": "North India",
    "type": "Bread"
  },
  {
    "id": "12",
    "text": "Tandoori chicken is chicken marinated in yogurt and spices, roasted in a tandoor.",
    "region": "Punjab",
    "type": "Main Course"
  },
  {
    "id": "13",
    "text": "Gulab jamun is a deep-fried milk-solid ball soaked in sweet syrup, served as dessert.",
    "region": "India",
    "type": "Dessert"
  },
  {
    "id": "14",
    "text": "Pav bhaji is a spicy vegetable mash served with soft buttered buns.",
    "region": "Mumbai",
    "type": "Snack"
  },
  {
    "id": "15",
    "text": "Raita is a yogurt-based condiment that cools down spicy dishes.",
    "region": "India",
    "type": "Condiment"
  },
  {
    "id": "16",
    "text": "Dhokla is a soft and fluffy savory cake made from fermented rice and chickpea flour.",
    "region": "Gujarat",
    "type": "Snack"
  },
  {
    "id": "17",
    "text": "Butter chicken is a rich tomato gravy dish with tender pieces of marinated chicken.",
    "region": "Delhi",
    "type": "Main Course"
  },
  {
    "id": "18",
    "text": "Lassi is a cold yogurt drink blended with sugar, salt, or fruits like mango.",
    "region": "Punjab",
    "type": "Drink"
  },
  {
    "id": "19",
    "text": "Momo is a type of South Asian dumpling popular in Nepal, filled with meat or vegetables and served with spicy chutney.",
    "region": "Nepal",
    "type": "Snack"
  },
  {
    "id": "20",
    "text": "Sel roti is a traditional homemade, sweet, ring-shaped rice bread from Nepal.",
    "region": "Nepal",
    "type": "Dessert"
  },
  {
    "id": "21",
    "text": "Hilsa curry is a traditional Bengali dish made with hilsa fish and mustard gravy.",
    "region": "Bangladesh",
    "type": "Main Course"
  },
  {
    "id": "22",
    "text": "Bhuna khichuri is a spiced rice and lentil dish often served with beef curry in Bangladesh.",
    "region": "Bangladesh",
    "type": "Main Course"
  },
  {
    "id": "23",
    "text": "Nihari is a slow-cooked stew of beef or lamb, eaten as breakfast in Pakistan.",
    "region": "Pakistan",
    "type": "Main Course"
  },
  {
    "id": "24",
    "text": "Chicken Karahi is a spicy curry cooked in a wok-like pan called a karahi, popular in Pakistan.",
    "region": "Pakistan",
    "type": "Main Course"
  },
  {
    "id": "25",
    "text": "Pad Thai is a stir-fried noodle dish with shrimp, peanuts, and tamarind sauce, one of Thailand's national dishes.",
    "region": "Thailand",
    "type": "Main Course"
  },
  {
    "id": "26",
    "text": "Tom Yum is a hot and sour Thai soup made with shrimp, lemongrass, and lime juice.",
    "region": "Thailand",
    "type": "Soup"
  },
  {
    "id": "27",
    "text": "Pho is a Vietnamese noodle soup consisting of broth, rice noodles, herbs, and meat.",
    "region": "Vietnam",
    "type": "Soup"
  },
  {
    "id": "28",
    "text": "Nasi Goreng is Indonesian-style fried rice often cooked with kecap manis, garlic, shallots, and chili.",
    "region": "Indonesia",
    "type": "Main Course"
  },
  {
    "id": "29",
    "text": "Rendang is a spicy meat dish slow-cooked in coconut milk and spices, originating from Indonesia.",
    "region": "Indonesia",
    "type": "Main Course"
  },
  {
    "id": "30",
    "text": "Nasi lemak is Malaysia's national dish consisting of fragrant rice cooked in coconut milk, served with sambal, anchovies, and egg.",
    "region": "Malaysia",
    "type": "Main Course"
  },
  {
    "id": "31",
    "text": "Adobo is a Filipino dish made by marinating meat in vinegar, soy sauce, and garlic, then simmering it.",
    "region": "Philippines",
    "type": "Main Course"
  },
  {
    "id": "32",
    "text": "Halo-halo is a Filipino dessert made from crushed ice, evaporated milk, and mixed ingredients like sweet beans, fruits, and jellies.",
    "region": "Philippines",
    "type": "Dessert"
  },
  {
    "id": "33",
    "text": "Peking duck is a famous Beijing dish featuring crispy roasted duck served with pancakes, hoisin sauce, and scallions.",
    "region": "China",
    "type": "Main Course"
  },
  {
    "id": "34",
    "text": "Kung Pao chicken is a spicy stir-fry dish made with chicken, peanuts, vegetables, and chili peppers.",
    "region": "China",
    "type": "Main Course"
  },
  {
    "id": "35",
    "text": "Mapo tofu is a Sichuan dish featuring soft tofu in a spicy chili and bean-based sauce, typically with minced pork.",
    "region": "Sichuan, China",
    "type": "Main Course"
  },
  {
    "id": "36",
    "text": "Xiao long bao are Chinese soup dumplings filled with meat and hot broth, typically served in a bamboo steamer.",
    "region": "Shanghai",
    "type": "Snack"
  },
  {
    "id": "37",
    "text": "Chow mein is a stir-fried noodle dish made with vegetables and sometimes meat or seafood.",
    "region": "China",
    "type": "Noodle"
  },
  {
    "id": "38",
    "text": "Hot and sour soup is a Chinese soup made with mushrooms, tofu, bamboo shoots, and egg, flavored with vinegar and white pepper.",
    "region": "China",
    "type": "Soup"
  },
  {
    "id": "39",
    "text": "Dim sum refers to a variety of small Chinese dishes served with tea, including dumplings, buns, and rolls.",
    "region": "Cantonese, China",
    "type": "Snack"
  },
  {
    "id": "40",
    "text": "Mooncake is a traditional Chinese pastry filled with lotus seed paste or red bean, eaten during the Mid-Autumn Festival.",
    "region": "China",
    "type": "Dessert"
  },
  {
    "id": "41",
    "text": "Kimchi is a traditional Korean side dish made from fermented vegetables, usually cabbage and radish, with chili pepper and garlic.",
    "region": "Korea",
    "type": "Side Dish"
  },
  {
    "id": "42",
    "text": "Bibimbap is a Korean mixed rice dish topped with sautéed vegetables, sliced meat, a fried egg, and chili paste.",
    "region": "Korea",
    "type": "Main Course"
  },
  {
    "id": "43",
    "text": "Tteokbokki is a popular Korean street food made of chewy rice cakes in a spicy red sauce.",
    "region": "Korea",
    "type": "Snack"
  },
  {
    "id": "44",
    "text": "Beef noodle soup is a beloved Taiwanese dish made with braised beef, vegetables, and noodles in a flavorful broth.",
    "region": "Taiwan",
    "type": "Soup"
  },
  {
    "id": "45",
    "text": "Lu rou fan is a classic Taiwanese comfort food of minced pork belly cooked in soy sauce, served over rice.",
    "region": "Taiwan",
    "type": "Main Course"
  },
  {
    "id": "46",
    "text": "Bubble tea is a Taiwanese drink made with tea, milk, and chewy tapioca pearls.",
    "region": "Taiwan",
    "type": "Drink"
  },
  {
    "id": "47",
    "text": "Char siu is a Cantonese-style barbecued pork known for its sweet and savory glaze.",
    "region": "Hong Kong",
    "type": "Main Course"
  },
  {
    "id": "48",
    "text": "Egg tarts are a popular Hong Kong dessert consisting of a flaky pastry crust filled with egg custard.",
    "region": "Hong Kong",
    "type": "Dessert"
  },
  {
    "id": "49",
    "text": "Wonton noodles are a Hong Kong dish made with thin egg noodles and wontons in a clear broth.",
    "region": "Hong Kong",
    "type": "Noodle"
  },
  {
    "id": "50",
    "text": "Meat pie is an iconic Australian dish consisting of a flaky pastry filled with minced meat and gravy.",
    "region": "Australia",
    "type": "Snack"
  },
  {
    "id": "51",
    "text": "Lamingtons are sponge cakes coated in chocolate and rolled in coconut, a popular Australian dessert.",
    "region": "Australia",
    "type": "Dessert"
  },
  {
    "id": "52",
    "text": "Pavlova is a meringue-based dessert topped with fresh fruit and cream, considered a national dish of New Zealand.",
    "region": "New Zealand",
    "type": "Dessert"
  },
  {
    "id": "53",
    "text": "Hangi is a traditional Māori method of cooking meat and vegetables in an underground oven.",
    "region": "New Zealand",
    "type": "Main Course"
  },
  {
    "id": "54",
    "text": "Palusami is a Polynesian dish of taro leaves filled with coconut cream and sometimes meat, baked in banana leaves.",
    "region": "Samoa, South Pacific",
    "type": "Main Course"
  },
  {
    "id": "55",
    "text": "Oka is a Samoan raw fish salad marinated in citrus and coconut milk, similar to ceviche.",
    "region": "Samoa, South Pacific",
    "type": "Appetizer"
  },
  {
    "id": "56",
    "text": "Lovo is a Fijian feast where food is wrapped in banana leaves and cooked in an earth oven.",
    "region": "Fiji, South Pacific",
    "type": "Main Course"
  },
  {
    "id": "57",
    "text": "Kokoda is a Fijian dish of raw fish marinated in lime juice and coconut milk, similar to ceviche.",
    "region": "Fiji, South Pacific",
    "type": "Appetizer"
  },
  {
    "id": "58",
    "text": "Poke is a Hawaiian dish of diced raw fish, typically seasoned with soy sauce and sesame oil.",
    "region": "Hawaii, USA",
    "type": "Appetizer"
  },
  {
    "id": "59",
    "text": "Spam musubi is a Hawaiian snack made of rice and Spam wrapped in seaweed.",
    "region": "Hawaii, USA",
    "type": "Snack"
  },
  {
    "id": "60",
    "text": "Loco moco is a Hawaiian dish consisting of rice topped with a hamburger patty, fried egg, and brown gravy.",
    "region": "Hawaii, USA",
    "type": "Main Course"
  },
  {
    "id": "61",
    "text": "Sushi is a Japanese dish of vinegared rice combined with seafood, vegetables, and sometimes tropical fruits.",
    "region": "Japan",
    "type": "Main Course"
  },
  {
    "id": "62",
    "text": "Ramen is a Japanese noodle soup dish with Chinese-style wheat noodles served in a meat or fish-based broth.",
    "region": "Japan",
    "type": "Main Course"
  },
  {
    "id": "63",
    "text": "Tempura is a Japanese dish of seafood or vegetables that have been battered and deep-fried.",
    "region": "Japan",
    "type": "Main Course"
  },
  {
    "id": "64",
    "text": "Miso soup is a traditional Japanese soup consisting of a stock called dashi into which softened miso paste is mixed.",
    "region": "Japan",
    "type": "Soup"
  },
  {
    "id": "65",
    "text": "Okonomiyaki is a savory Japanese pancake containing a variety of ingredients.",
    "region": "Japan",
    "type": "Main Course"
  },
  {
    "id": "66",
    "text": "Hummus is a Middle Eastern dip or spread made from cooked, mashed chickpeas blended with tahini, olive oil, lemon juice, and garlic.",
    "region": "Middle East",
    "type": "Appetizer"
  },
  {
    "id": "67",
    "text": "Falafel consists of deep-fried balls of ground chickpeas or fava beans, typically served in pita bread.",
    "region": "Middle East",
    "type": "Main Course"
  },
  {
    "id": "68",
    "text": "Shawarma is a Middle Eastern meat preparation where thin slices of lamb, chicken, or beef are stacked and roasted on a vertical rotisserie.",
    "region": "Middle East",
    "type": "Main Course"
  },
  {
    "id": "69",
    "text": "Tabbouleh is a Levantine vegetarian salad made of finely chopped parsley, tomatoes, mint, and bulgur.",
    "region": "Middle East",
    "type": "Salad"
  },
  {
    "id": "70",
    "text": "Baklava is a rich, sweet dessert pastry made of layers of filo filled with chopped nuts and sweetened with syrup or honey.",
    "region": "Middle East",
    "type": "Dessert"
  },
  {
    "id": "71",
    "text": "Buuz are Mongolian steamed dumplings filled with minced meat, typically mutton or beef.",
    "region": "Mongolia",
    "type": "Main Course"
  },
  {
    "id": "72",
    "text": "Khorkhog is a Mongolian barbecue dish where meat is cooked with hot stones inside a sealed container.",
    "region": "Mongolia",
    "type": "Main Course"
  },
  {
    "id": "73",
    "text": "Airag is a traditional Mongolian alcoholic drink made from fermented mare's milk.",
    "region": "Mongolia",
    "type": "Beverage"
  },
  {
    "id": "74",
    "text": "Boortsog are Mongolian deep-fried cookies often served with tea or used as a dessert.",
    "region": "Mongolia",
    "type": "Dessert"
  },
  {
    "id": "75",
    "text": "Suutei tsai is a traditional Mongolian milk tea made with green tea, milk, water, and salt.",
    "region": "Mongolia",
    "type": "Beverage"
  },
  {
    "id": "76",
    "text": "Char Siu is a traditional Cantonese roasted pork dish with honey and soy glaze.",
    "name": "Cantonese Char Siu",
    "category": "Barbecue",
    "origin": "Guangdong, China",
    "description": "Char Siu is a traditional Cantonese roasted pork dish made from marinated pork loin coated with honey, soy sauce, fermented bean curd, and sugar. The meat is roasted until tender and caramelized, giving it a shiny red glaze and a slightly sweet aroma that represents the essence of Cantonese roast meats.",
    "ingredients": ["pork loin", "honey", "soy sauce", "fermented bean curd", "sugar", "oyster sauce"],
    "method": "Marinate pork for 6 hours, roast at 200°C for about 25 minutes while brushing honey glaze several times.",
    "nutrition": "Rich in protein and energy; moderate fat content provides satiety. Best balanced with vegetables.",
    "cultural_significance": "Char Siu is a symbol of Cantonese culinary culture and often served during family gatherings and festivals.",
    "dietary_classification": ["non-vegetarian"]
  },
  {
    "id": "77",
    "text": "Hainanese Chicken Rice is tender poached chicken served with fragrant rice and chili sauce.",
    "name": "Hainanese Chicken Rice",
    "category": "Main Course",
    "origin": "Hainan, China",
    "description": "Hainanese Chicken Rice features tender poached chicken paired with fragrant rice cooked in chicken broth and fat. The chicken remains juicy and silky, while the rice carries the aroma of garlic and ginger. Served with chili sauce and soy dressing, it offers a delicate and comforting balance of flavors.",
    "ingredients": ["chicken", "jasmine rice", "chicken broth", "ginger", "garlic", "soy sauce"],
    "method": "Poach chicken slowly, cool in ice water, fry rice in chicken fat, then cook rice with chicken broth. Serve with chili and soy sauce.",
    "nutrition": "High in lean protein and vitamin B complex; relatively low in fat when skin is removed.",
    "cultural_significance": "Represents the light, balanced flavor style of southern Chinese cuisine and symbolizes home-style comfort.",
    "dietary_classification": ["non-vegetarian", "gluten-free"]
  },
  {
    "id": "78",
    "text": "Mapo Tofu is a spicy Sichuan dish of tofu and minced beef in chili bean sauce.",
    "name": "Mapo Tofu",
    "category": "Hot Dish",
    "origin": "Sichuan, China",
    "description": "Mapo Tofu is a signature Sichuan dish combining soft tofu, minced beef, and spicy bean paste. Known for its 'mala' flavor (numbing and spicy), it delivers a bold and aromatic taste highlighted by Sichuan peppercorns. The silky tofu contrasts with the rich chili oil sauce, creating a unique texture.",
    "ingredients": ["tofu", "ground beef", "doubanjiang", "Sichuan peppercorn", "garlic", "chili oil"],
    "method": "Stir-fry minced beef with bean paste and peppercorns, add tofu cubes and simmer briefly in sauce.",
    "nutrition": "High in plant protein and minerals; moderate spice aids metabolism and circulation.",
    "cultural_significance": "Represents the bold, fiery spirit of Sichuan cuisine and the concept of harmony in contrasting flavors.",
    "dietary_classification": ["non-vegetarian"]
  },
  {
    "id": "79",
    "text": "Kung Pao Chicken mixes diced chicken, peanuts, and chili in a sweet-spicy sauce.",
    "name": "Kung Pao Chicken",
    "category": "Stir-Fry",
    "origin": "Sichuan, China",
    "description": "Kung Pao Chicken combines diced chicken, peanuts, and dried chili peppers stir-fried in a savory-sweet sauce. The dish balances spiciness, sweetness, and nutty flavor, delivering both crunch and tenderness in each bite. It has become one of China's most recognized international dishes.",
    "ingredients": ["chicken", "peanuts", "dried chili", "soy sauce", "vinegar", "sugar"],
    "method": "Stir-fry chicken cubes, add dried chili and peanuts, then mix with soy-based sauce until thickened.",
    "nutrition": "High in protein and healthy fats; contains antioxidants from chili and peanuts.",
    "cultural_significance": "Named after an imperial official, it symbolizes harmony between flavors and balance in life.",
    "dietary_classification": ["non-vegetarian", "gluten-free"]
  },
  {
    "id": "80",
    "text": "Peking Duck is a famous Beijing dish with crispy skin and tender meat.",
    "name": "Beijing Peking Duck",
    "category": "Roast",
    "origin": "Beijing, China",
    "description": "Peking Duck is a world-famous Chinese roast dish featuring crispy skin and tender meat. The duck is air-dried, glazed with maltose, and roasted to perfection. It is traditionally served with thin pancakes, cucumber, scallion, and sweet bean sauce for a balanced bite.",
    "ingredients": ["duck", "maltose syrup", "cucumber", "scallion", "sweet bean sauce"],
    "method": "Air-dry marinated duck, glaze with maltose syrup, and roast until golden brown and crisp.",
    "nutrition": "High in protein and iron; duck fat offers healthy monounsaturated fats when consumed moderately.",
    "cultural_significance": "Served at banquets and national events, representing Chinese culinary sophistication and hospitality.",
    "dietary_classification": ["non-vegetarian"]
  },
  {
    "id": "81",
    "text": "Sweet and Sour Pork combines crispy pork with tangy sauce and pineapple.",
    "name": "Sweet and Sour Pork",
    "category": "Main Dish",
    "origin": "Guangdong, China",
    "description": "Sweet and Sour Pork features crispy fried pork coated with a tangy-sweet sauce made from vinegar, sugar, and ketchup. The sauce clings to the meat and pairs with bell peppers and pineapple for balance. It’s beloved for its vivid flavor and color.",
    "ingredients": ["pork", "bell peppers", "pineapple", "vinegar", "ketchup", "sugar"],
    "method": "Deep-fry pork cubes, stir-fry with vegetables, and toss in sweet-sour sauce until glossy.",
    "nutrition": "High in protein and carbohydrates; moderate sugar intake recommended.",
    "cultural_significance": "A symbol of happiness and prosperity due to its bright red color, often served at festive meals.",
    "dietary_classification": ["non-vegetarian"]
  },
  {
    "id": "82",
    "text": "Xiaolongbao are steamed soup dumplings filled with pork and rich broth.",
    "name": "Xiaolongbao (Soup Dumplings)",
    "category": "Dim Sum",
    "origin": "Shanghai, China",
    "description": "Xiaolongbao are steamed soup dumplings filled with minced pork and rich broth encased in delicate dough. Each bite bursts with flavorful soup, offering a satisfying and elegant dining experience. The technique requires precise folding and temperature control.",
    "ingredients": ["flour", "pork", "gelatin", "ginger", "soy sauce", "vinegar"],
    "method": "Wrap pork and gelatin mixture in thin dough, steam until translucent, serve with vinegar sauce.",
    "nutrition": "Rich in collagen and protein; moderate carb content from wrapper.",
    "cultural_significance": "A symbol of craftsmanship and delicacy, representing Jiangnan’s refined culinary art.",
    "dietary_classification": ["non-vegetarian"]
  },
  {
    "id": "83",
    "text": "Yangzhou Fried Rice mixes ham, shrimp, egg, and vegetables for color and flavor.",
    "name": "Yangzhou Fried Rice",
    "category": "Rice Dish",
    "origin": "Jiangsu, China",
    "description": "Yangzhou Fried Rice is a colorful stir-fried rice dish combining diced ham, shrimp, egg, and vegetables. Each grain of rice remains separate and fragrant. The dish emphasizes balance, harmony, and proper heat control in Chinese wok cooking.",
    "ingredients": ["rice", "egg", "shrimp", "ham", "peas", "carrot"],
    "method": "Stir-fry all ingredients on high heat to maintain rice separation and aroma.",
    "nutrition": "High in carbohydrates and complete protein from shrimp and egg.",
    "cultural_significance": "A classic banquet dish symbolizing abundance and unity.",
    "dietary_classification": ["non-vegetarian", "gluten-free"]
  },
  {
    "id": "84",
    "text": "Hot Pot is a communal meal where diners cook meats and vegetables in broth.",
    "name": "Hot Pot",
    "category": "Communal Meal",
    "origin": "Chongqing, China",
    "description": "Hot Pot is a social dining tradition where diners cook thinly sliced meats, vegetables, and tofu in a simmering pot of broth at the table. The spicy Sichuan version features chili oil and peppercorns, creating a lively, shared experience around flavor and conversation.",
    "ingredients": ["beef", "tofu", "mushroom", "chili oil", "broth", "vegetables"],
    "method": "Boil broth, add ingredients, dip cooked items in sauce to eat.",
    "nutrition": "Balanced meal providing protein, fiber, and essential minerals.",
    "cultural_significance": "Symbolizes unity and warmth; popular in winter and family gatherings.",
    "dietary_classification": ["non-vegetarian", "vegetarian options available"]
  },
  {
    "id": "85",
    "text": "Steamed Fish with Soy Sauce highlights the freshness of fish with light seasoning.",
    "name": "Steamed Fish with Soy Sauce",
    "category": "Seafood",
    "origin": "Guangdong, China",
    "description": "A classic Cantonese dish featuring whole fish steamed until tender, then topped with soy sauce, ginger, and scallion oil. The flavor is light and natural, highlighting the fish’s freshness rather than heavy seasoning.",
    "ingredients": ["whole fish", "soy sauce", "ginger", "scallion", "oil"],
    "method": "Steam fish for 8 minutes, pour hot oil and soy sauce mixture on top before serving.",
    "nutrition": "Rich in omega-3 fatty acids, protein, and low in fat.",
    "cultural_significance": "Served at Lunar New Year as fish symbolizes abundance ('nian nian you yu').",
    "dietary_classification": ["non-vegetarian", "gluten-free"]
  },
  {
    "id": "86",
    "text": "Congee with Century Egg and Pork is a comforting rice porridge with rich flavor.",
    "name": "Congee with Century Egg and Pork",
    "category": "Breakfast",
    "origin": "Southern China",
    "description": "A comforting rice porridge made with preserved century eggs, minced pork, and ginger. Smooth and nourishing, it’s widely eaten for breakfast or when recovering from illness, offering both warmth and gentle nutrition.",
    "ingredients": ["rice", "century egg", "pork", "ginger", "salt", "scallion"],
    "method": "Boil rice into porridge, add pork and eggs, simmer until thick and fragrant.",
    "nutrition": "Easily digestible carbohydrates, moderate protein, and electrolytes for recovery.",
    "cultural_significance": "Represents comfort food in Chinese households; served to convey care and warmth.",
    "dietary_classification": ["non-vegetarian", "gluten-free"]
  },
  {
    "id": "87",
    "text": "Stir-Fried Bok Choy with Garlic is a simple, light, and healthy vegetable dish.",
    "name": "Stir-Fried Bok Choy with Garlic",
    "category": "Vegetable Dish",
    "origin": "Eastern China",
    "description": "A simple yet flavorful vegetable dish featuring fresh bok choy stir-fried quickly with garlic and a touch of salt. It preserves the vegetable’s bright color and crisp texture while retaining nutrients. The dish highlights the Chinese philosophy of letting ingredients shine.",
    "ingredients": ["bok choy", "garlic", "salt", "oil"],
    "method": "Stir-fry garlic in oil, add bok choy, and cook for 2 minutes over high heat.",
    "nutrition": "High in vitamins A and C, calcium, and dietary fiber.",
    "cultural_significance": "A common side dish in Chinese meals representing simplicity and balance.",
    "dietary_classification": ["vegetarian", "vegan", "gluten-free"]
  },
  {
    "id": "88",
    "text": "Mooncakes are traditional pastries eaten during the Mid-Autumn Festival.",
    "name": "Mooncakes",
    "category": "Dessert",
    "origin": "China",
    "description": "Mooncakes are traditional pastries eaten during the Mid-Autumn Festival. They have a dense filling such as lotus seed paste or red bean and may contain salted egg yolks. The round shape symbolizes unity and family reunion under the full moon.",
    "ingredients": ["flour", "lotus seed paste", "egg yolk", "sugar", "oil"],
    "method": "Wrap filling with dough, press into molds, and bake until golden brown.",
    "nutrition": "High in carbohydrates and fat; best enjoyed in moderation.",
    "cultural_significance": "Represents reunion and gratitude, central to the Mid-Autumn Festival celebration.",
    "dietary_classification": ["vegetarian"]
  },
  {
    "id": "89",
    "text": "Zongzi are sticky rice dumplings wrapped in bamboo leaves for Dragon Boat Festival.",
    "name": "Zongzi (Sticky Rice Dumpling)",
    "category": "Festival Food",
    "origin": "China",
    "description": "Zongzi are glutinous rice dumplings wrapped in bamboo leaves, traditionally eaten during the Dragon Boat Festival. Fillings vary from savory pork to sweet red bean paste. The dish honors poet Qu Yuan and embodies themes of loyalty and remembrance.",
    "ingredients": ["glutinous rice", "pork", "red bean", "bamboo leaves", "soy sauce"],
    "method": "Wrap fillings in bamboo leaves with rice, tie tightly, and boil or steam for hours.",
    "nutrition": "High in carbohydrates, provides slow-release energy and fiber when using whole grains.",
    "cultural_significance": "Symbol of patriotism and family tradition during the Dragon Boat Festival.",
    "dietary_classification": ["vegetarian", "non-vegetarian versions exist"]
  },
  {
    "id": "90",
    "text": "Beef Chow Fun is a Cantonese stir-fried noodle dish with beef and bean sprouts.",
    "name": "Beef Chow Fun",
    "category": "Noodle Dish",
    "origin": "Guangdong, China",
    "description": "Beef Chow Fun is a popular Cantonese stir-fried noodle dish made with flat rice noodles, tender beef slices, bean sprouts, and soy sauce. It features a smoky wok aroma known as 'wok hei' and balances savory and slightly sweet flavors perfectly.",
    "ingredients": ["beef", "flat rice noodles", "bean sprouts", "soy sauce", "onion", "oil"],
    "method": "Stir-fry beef until half-cooked, add noodles and sauce, toss quickly over high heat to develop wok aroma.",
    "nutrition": "Provides carbohydrates, protein, and iron; moderate fat content when prepared with lean beef.",
    "cultural_significance": "A staple of Cantonese street food culture, symbolizing simplicity and mastery of wok cooking.",
    "dietary_classification": ["non-vegetarian", "gluten-free"]
  },
  {
    "id": "91",
    "text": "Thai Green Curry with chicken and vegetables simmered in aromatic coconut milk and herbs.",
    "name": "Thai Green Curry",
    "category": "Curry",
    "origin": "Thailand",
    "region": "Thailand",
    "type": "Main Course",
    "description": "Thai Green Curry is a fragrant, moderately spicy curry built on a paste of fresh green chilies, lemongrass, galangal, kaffir lime peel, garlic, and shallots. Simmered with coconut milk, it develops a silky, aromatic sauce that coats tender chicken or tofu and assorted vegetables like eggplant, bamboo shoots, and bell peppers. The dish balances heat with sweetness and citrusy brightness, delivering layers of flavor in every bite. Served with jasmine rice, it’s warming yet refreshing, representing the hallmark harmony of Thai cuisine.",
    "ingredients": ["green curry paste", "coconut milk", "chicken or tofu", "Thai eggplant", "bamboo shoots", "bell pepper", "fish sauce or soy sauce", "palm sugar", "Thai basil", "kaffir lime leaves"],
    "method": "Bloom green curry paste in oil, add coconut milk and bring to a gentle simmer. Add protein and vegetables, season with fish sauce (or soy), palm sugar, and kaffir lime leaves. Finish with Thai basil and serve over jasmine rice.",
    "nutrition": "Coconut milk provides medium-chain fats for sustained energy; lean protein supports muscle repair; vegetables add fiber, potassium, and antioxidants.",
    "cultural_significance": "Green curry exemplifies central Thai flavor balance and is a weeknight favorite served family-style.",
    "regional_variations": "Southern versions are often hotter; vegetarian versions replace fish sauce with soy and use tofu.",
    "dietary_classification": ["non-vegetarian", "vegetarian option", "gluten-free"],
    "allergens": ["fish (fish sauce)", "soy (if substituting)"]
  },
  {
    "id": "92",
    "text": "Mediterranean Mezze Platter with hummus, baba ghanoush, tabbouleh, olives, and warm flatbread.",
    "name": "Mediterranean Mezze Platter",
    "category": "Appetizer/Sharing",
    "origin": "Eastern Mediterranean",
    "region": "Levant & Aegean",
    "type": "Appetizer",
    "description": "A Mediterranean mezze platter is a colorful spread of small dishes meant for sharing, showcasing the freshness and variety of Levantine and Aegean cuisines. Classic components include creamy hummus, smoky baba ghanoush, bright and herby tabbouleh, marinated olives, pickled vegetables, stuffed grape leaves, and crisp cucumbers and tomatoes. Served with warm pita or flatbread, mezze invites grazing and conversation. Light yet satisfying, it highlights olive oil, legumes, herbs, and vegetables that define Mediterranean eating and support heart health.",
    "ingredients": ["chickpeas", "tahini", "eggplant", "bulgur", "parsley", "mint", "olive oil", "lemon", "olives", "grape leaves", "pita"],
    "method": "Prepare dips (hummus, baba ghanoush), chop tabbouleh, assemble olives, pickles, and fresh vegetables. Warm pita and arrange everything on a large platter for sharing.",
    "nutrition": "Rich in fiber, plant protein, and monounsaturated fats from olive oil; provides folate, vitamin C, and iron from herbs and legumes.",
    "cultural_significance": "Mezze is central to social dining across the Eastern Mediterranean, encouraging leisurely, communal meals.",
    "regional_variations": "Greek spreads may include tzatziki and feta; Turkish spreads add ezme; Lebanese versions emphasize tabbouleh and pickles.",
    "dietary_classification": ["vegetarian", "vegan option"],
    "allergens": ["sesame (tahini)", "gluten (pita)"]
  },
  {
    "id": "93",
    "text": "Ethiopian Doro Wat, a spiced chicken stew simmered in berbere and clarified butter, served with injera.",
    "name": "Doro Wat",
    "category": "Stew",
    "origin": "Ethiopia",
    "region": "Horn of Africa",
    "type": "Main Course",
  "description": "Doro Wat is Ethiopia’s iconic spicy chicken stew, built on an unusually large quantity of onions cooked slowly until jammy and sweet, then enriched with niter kibbeh (spiced clarified butter) and berbere, a fragrant, fiery blend. Hard-boiled eggs absorb the brick-red sauce, while lemon and ginger brighten the heat so the dish stays vivid rather than heavy. Served atop tangy, spongy injera, it’s eaten communally by tearing bread to scoop each bite. In homes and holiday feasts, Doro Wat symbolizes generosity, patience, and celebration across generations.",
    "ingredients": ["chicken", "onions", "berbere", "niter kibbeh", "garlic", "ginger", "tomato paste", "lemon", "hard-boiled eggs", "injera"],
    "method": "Sweat a large amount of onions until deeply caramelized, stir in berbere, garlic, ginger, and tomato paste. Add chicken and water, simmer until tender. Finish with niter kibbeh and lemon; serve with injera and eggs.",
    "nutrition": "High in protein and iron; berbere provides capsaicin and antioxidants; injera (teff) contributes fiber and minerals like manganese.",
    "cultural_significance": "A centerpiece of Ethiopian holiday meals and shared platters, symbolizing hospitality and celebration.",
    "regional_variations": "Heat levels vary; some versions are richer with more niter kibbeh, others are lighter and more lemon-forward.",
    "dietary_classification": ["non-vegetarian", "gluten-free"],
    "allergens": ["dairy (niter kibbeh)"]
  },
  {
    "id": "94",
    "text": "Peruvian Ceviche Clásico with fresh white fish cured in lime juice, red onion, chili, and cilantro.",
    "name": "Ceviche Clásico",
    "category": "Seafood/Appetizer",
    "origin": "Peru",
    "region": "Coastal Peru",
    "type": "Appetizer",
  "description": "Peruvian Ceviche Clásico lightly ‘cooks’ pristine white fish in tart lime juice, which firms the flesh while preserving clean oceanic notes. Thin red onion, cilantro, and ají chilies add crunch, fragrance, and a measured heat; sides of sweet potato and choclo balance acidity with sweetness and starch. Bright, crisp, and bracingly fresh, ceviche is a midday coastal ritual eaten as soon as it’s mixed, often with a splash of leche de tigre. Purity of fish and restraint of marination time define its elegance.",
    "ingredients": ["firm white fish", "lime juice", "red onion", "ají limo or amarillo", "cilantro", "salt", "sweet potato", "choclo"],
    "method": "Cut fish into cubes, briefly marinate in lime juice with salt, onion, chili, and cilantro. Serve promptly with boiled sweet potato and choclo.",
    "nutrition": "Very high in lean protein and vitamin B12; lime provides vitamin C; low in fat; potassium from sweet potato.",
    "cultural_significance": "A national symbol in Peru and a coastal ritual, often enjoyed at lunch when fish is freshest.",
    "regional_variations": "Northern styles may be spicier; some versions include leche de tigre shots; Ecuadorian styles are saucier.",
    "dietary_classification": ["pescatarian", "gluten-free"],
    "allergens": ["fish"]
  },
  {
    "id": "95",
    "text": "Moroccan Lamb Tagine with apricots, almonds, and warm spices, slow-cooked until meltingly tender.",
    "name": "Lamb Tagine with Apricots",
    "category": "Tagine/Stew",
    "origin": "Morocco",
    "region": "Maghreb",
    "type": "Main Course",
  "description": "This Moroccan tagine layers lamb with onions, garlic, ginger, cinnamon, saffron, and ras el hanout, then simmers gently with dried apricots until glossy and aromatic. Toasted almonds add welcome crunch against succulent meat, while preserved lemon lifts sweetness with citrusy perfume. Traditionally cooked in a conical clay tagine, the narrow chimney traps aromas and condenses steam, basting the stew. Served with couscous or warm flatbread, it embodies souk spices, caravan trade history, and the Moroccan art of balancing savory with fruit.",
    "ingredients": ["lamb", "onion", "garlic", "ras el hanout", "ginger", "cinnamon", "saffron", "dried apricots", "preserved lemon", "almonds"],
    "method": "Brown lamb, sweat onions and spices, add water and apricots, then braise low and slow until tender. Finish with preserved lemon and toasted almonds.",
    "nutrition": "Provides iron, zinc, and protein; dried apricots contribute fiber and beta-carotene; moderate fat depending on cut.",
    "cultural_significance": "A festive centerpiece at Moroccan family gatherings, expressing hospitality and spice-trade heritage.",
    "regional_variations": "Chicken or beef can replace lamb; prunes or dates are sometimes used instead of apricots.",
    "dietary_classification": ["non-vegetarian"],
    "allergens": ["tree nuts (almonds)"]
  },
  {
    "id": "96",
    "text": "Greek Moussaka with layers of eggplant, spiced meat, and silky béchamel baked to golden comfort.",
    "name": "Moussaka",
    "category": "Baked Casserole",
    "origin": "Greece",
    "region": "Greece",
    "type": "Main Course",
  "description": "Moussaka is a layered casserole of sautéed eggplant and a warmly spiced lamb or beef ragu perfumed with cinnamon, oregano, and tomato, finished under a thick, custardy béchamel. Baked until bronzed and bubbling, it contrasts soft vegetables with rich sauce and a silky top. Resting before slicing helps the layers set cleanly. Served in generous squares with salad and bread, moussaka evokes Greek tavernas, Sunday lunches, and gatherings where comfort and conviviality matter as much as the recipe.",
    "ingredients": ["eggplant", "ground lamb or beef", "onion", "tomato", "garlic", "oregano", "cinnamon", "béchamel (milk, flour, butter)", "olive oil"],
    "method": "Salt and pan-fry eggplant; cook meat sauce with tomatoes and spices; layer in a dish, top with béchamel, and bake until golden.",
    "nutrition": "High in protein and calcium (from béchamel), fiber from eggplant; calories vary by oil and meat choice.",
    "cultural_significance": "A Sunday lunch classic and tavern favorite across Greece, evoking family gatherings.",
    "regional_variations": "Some regions add potatoes or zucchini; lighter versions use yogurt-based topping.",
    "dietary_classification": ["non-vegetarian"],
    "allergens": ["dairy", "gluten (béchamel)"]
  },
  {
    "id": "97",
    "text": "Turkish Menemen, soft-scrambled eggs with tomatoes, peppers, and olive oil, perfect for breakfast.",
    "name": "Menemen",
    "category": "Breakfast",
    "origin": "Turkey",
    "region": "Anatolia",
    "type": "Breakfast",
  "description": "Menemen is a Turkish breakfast staple of gently scrambled eggs with ripe tomatoes, green peppers, and plenty of olive oil. Some households include onion, others debate it passionately; either way, the eggs are barely set for a creamy, spoonable texture. Seasoned with salt and pul biber, the dish is scooped with crusty bread and paired with tea. Unfussy but soulful, menemen celebrates Mediterranean produce and the ritual of lingering over breakfast with family. Many cooks enrich it with feta or kasar cheese and finish with parsley for a fragrant lift.",
    "ingredients": ["eggs", "tomatoes", "green peppers", "onion", "olive oil", "pul biber", "salt"],
    "method": "Sauté onion and peppers in olive oil, add tomatoes and reduce, then gently fold in eggs until barely set.",
    "nutrition": "Eggs supply complete protein and choline; tomatoes and peppers add vitamin C, lycopene, and fiber; olive oil provides heart-healthy fats.",
    "cultural_significance": "A beloved Turkish breakfast dish served family-style with tea and bread.",
    "regional_variations": "Cheese or sucuk (sausage) may be added; onion usage varies by household.",
    "dietary_classification": ["vegetarian", "gluten-free"],
    "allergens": ["egg"]
  },
  {
    "id": "98",
    "text": "Spanish Paella Valenciana with saffron rice, chicken, rabbit, and seasonal vegetables cooked in a wide pan.",
    "name": "Paella Valenciana",
    "category": "Rice Dish",
    "origin": "Spain",
    "region": "Valencia",
    "type": "Main Course",
  "description": "Paella Valenciana is the rustic ancestor of Spain’s many paellas. Short-grain rice is simmered in a saffron-tinted broth with chicken, rabbit, tomatoes, garrofó beans, and rosemary, then left undisturbed so a prized socarrat forms against the wide pan. Traditionally cooked outdoors over wood, it carries a subtle smokiness and encourages communal eating straight from the pan. Seasonal vegetables and local stock make each rendition unique while the technique—no stirring late—keeps it unmistakably Valencian. A squeeze of lemon tableside brightens each bite without masking saffron’s perfume.",
    "ingredients": ["short-grain rice", "chicken", "rabbit", "garrofó beans", "tomato", "saffron", "paprika", "rosemary", "olive oil", "stock"],
    "method": "Sear meats, build a sofrito, add rice and saffroned stock, then cook undisturbed to form socarrat. Rest briefly before serving.",
    "nutrition": "Balanced carbs and protein; beans add fiber and folate; saffron provides antioxidant compounds.",
    "cultural_significance": "A symbol of Valencian identity and Spanish communal dining, often prepared on weekends outdoors.",
    "regional_variations": "Seafood paella, mixed paella, and vegetarian paella are widespread adaptations.",
    "dietary_classification": ["non-vegetarian"],
    "allergens": []
  },
  {
    "id": "99",
    "text": "Quinoa Buddha Bowl with roasted vegetables, chickpeas, and tahini-lemon dressing for a balanced, colorful meal.",
    "name": "Quinoa Buddha Bowl",
    "category": "Healthy Bowl",
    "origin": "Global",
    "region": "Global",
    "type": "Main Course",
  "description": "A quinoa Buddha bowl layers fluffy quinoa with roasted sweet potatoes, broccoli, and chickpeas, plus fresh greens, avocado, and seeds for crunch. A zesty tahini–lemon dressing ties everything together with creaminess and lift. Balanced by design, it delivers complete plant protein, complex carbs, and heart-healthy fats, leaving you satisfied without sluggishness. Easy to batch, it invites seasonal swaps—from roasted cauliflower to pan-seared tofu—and holds well for next-day lunches. Add fermented elements like kimchi or pickled onions to support gut health and brightness.",
    "ingredients": ["quinoa", "sweet potato", "broccoli", "chickpeas", "mixed greens", "avocado", "tahini", "lemon", "olive oil", "pumpkin seeds"],
    "method": "Roast vegetables and chickpeas, cook quinoa separately. Assemble with fresh greens and avocado; drizzle with tahini-lemon dressing.",
    "nutrition": "High in fiber, magnesium, and complete plant protein; healthy fats from avocado and seeds support satiety and nutrient absorption.",
    "cultural_significance": "Represents modern health-focused eating and bowl-style assembly meals.",
    "regional_variations": "Swap seasonal vegetables; use amaranth or brown rice instead of quinoa.",
    "dietary_classification": ["vegetarian", "vegan", "gluten-free"],
    "allergens": ["sesame (tahini)"]
  },
  {
    "id": "100",
    "text": "Grilled Salmon with roasted vegetables and herbs, a heart-healthy, protein-rich plate.",
    "name": "Grilled Salmon & Veg",
    "category": "Healthy Plate",
    "origin": "Global",
    "region": "Global",
    "type": "Main Course",
  "description": "This plate features salmon fillets grilled until just flaky, skin crackling and flesh glossy, paired with caramelized seasonal vegetables. A squeeze of lemon and drizzle of olive oil finish it cleanly. Rich in omega‑3s and high-quality protein, it’s substantial yet light, ideal for weeknights. Season simply with garlic, pepper, and herbs; cook skin-side down for crispness before a brief flip. The simplicity foregrounds salmon’s flavor while keeping nutrition front and center. Leftovers make excellent salad toppers with grains and citrus.",
    "ingredients": ["salmon", "lemon", "olive oil", "garlic", "Brussels sprouts", "carrots", "bell peppers", "salt", "pepper"],
    "method": "Season salmon and grill skin-side first; roast vegetables until caramelized. Serve with lemon and olive oil.",
    "nutrition": "Excellent source of omega-3 fatty acids (EPA/DHA) for heart and brain health; high-quality protein; fiber and vitamins A/C from vegetables.",
    "cultural_significance": "A cornerstone of many modern Mediterranean-style diets.",
    "regional_variations": "Swap salmon for trout or mackerel; use local vegetables by season.",
    "dietary_classification": ["pescatarian", "gluten-free"],
    "allergens": ["fish"]
  },
  {
    "id": "101",
    "text": "Lentil and Kale Super Salad with lemony vinaigrette, toasted nuts, and seeds for crunch and minerals.",
    "name": "Lentil & Kale Super Salad",
    "category": "Salad",
    "origin": "Global",
    "region": "Global",
    "type": "Salad",
  "description": "This hearty salad combines tender green or French lentils with finely shredded kale, grated carrots, and herbs in a lemon–mustard vinaigrette. Massaging the kale softens fibers and tames bitterness so it mingles with nutty lentils. Toasted nuts and pumpkin seeds add crunch and healthy fats, making a bowl that satisfies without heaviness. It travels well for lunches and pairs easily with fish or tofu. For extra minerals and brightness, fold in diced roasted beets and a splash of apple cider vinegar.",
    "ingredients": ["lentils", "kale", "carrot", "parsley", "lemon", "olive oil", "mustard", "almonds or walnuts", "pumpkin seeds"],
    "method": "Cook and cool lentils; massage kale with a bit of oil, then toss everything with vinaigrette and toasted nuts.",
    "nutrition": "High in fiber, folate, and iron from lentils; kale provides vitamins K, A, and C; nuts supply unsaturated fats for heart health.",
    "cultural_significance": "Reflects plant-forward, protein-rich salads popular in contemporary cafes.",
    "regional_variations": "Use French green lentils for firmer texture; swap kale for spinach or arugula.",
    "dietary_classification": ["vegetarian", "vegan", "gluten-free"],
    "allergens": ["tree nuts (optional)"]
  },
  {
    "id": "102",
    "text": "Tofu and Broccoli Stir-Fry, light-sauce, high-protein, and weeknight-fast.",
    "name": "Tofu & Broccoli Stir-Fry (Low Sodium)",
    "category": "Stir-Fry",
    "origin": "East Asia-inspired",
    "region": "Global",
    "type": "Main Course",
  "description": "Firm tofu is pressed and seared until golden, then tossed with crisp-tender broccoli in a ginger–garlic sauce brightened with citrus and reduced-sodium tamari. A dusting of cornstarch helps the tofu turn lightly crisp so the glaze clings without excess salt. The result is clean, savory, and weeknight-fast over brown rice or cauliflower rice. Add snap peas, mushrooms, or chili crisp to vary texture and heat. Finish with scallions and toasted sesame for aroma and a hint of nuttiness.",
    "ingredients": ["firm tofu", "broccoli", "garlic", "ginger", "reduced-sodium tamari", "rice vinegar", "orange zest", "sesame oil (optional)", "cornstarch"],
    "method": "Press tofu and sear; stir-fry broccoli and aromatics; add light sauce and toss to coat. Serve immediately.",
    "nutrition": "High in plant protein, calcium (if calcium-set tofu), and vitamin C; fiber supports gut health; reduced sodium suits heart-conscious diets.",
    "cultural_significance": "A modern, health-forward take on classic Chinese-style home cooking.",
    "regional_variations": "Add snap peas or mushrooms; swap tamari for coconut aminos.",
    "dietary_classification": ["vegetarian", "vegan", "gluten-free option"],
    "allergens": ["soy", "sesame (optional)"]
  },
  {
    "id": "103",
    "text": "Overnight Oats with chia, berries, and yogurt for a fiber-rich, make-ahead breakfast.",
    "name": "Overnight Oats & Chia",
    "category": "Breakfast",
    "origin": "Global",
    "region": "Global",
    "type": "Breakfast",
  "description": "Rolled oats soak overnight in milk or yogurt until spoonably creamy, then get topped with chia, berries, and nuts. The make-ahead method builds slow-release energy from oats’ beta‑glucan, omega‑3s from chia, and polyphenols from berries. It’s endlessly adaptable—swap dairy for soy yogurt, change fruit with the seasons, or stir in cinnamon for warmth. Mornings stay calm while nutrition stays high. Jar portions keep a few days and travel well for desk breakfasts or school, minimizing morning decisions while maximizing nourishment.",
    "ingredients": ["rolled oats", "milk or yogurt", "chia seeds", "berries", "honey or maple", "nuts (optional)", "vanilla"],
    "method": "Combine oats and liquid in a jar; refrigerate overnight. Stir and top with chia, berries, and nuts just before serving.",
    "nutrition": "High in soluble fiber (beta-glucan) for cholesterol support; protein from dairy or soy yogurt; polyphenols from berries.",
    "cultural_significance": "Reflects the global shift toward convenient, nutritious breakfasts.",
    "regional_variations": "Use plant milks; add spices like cinnamon or cardamom.",
    "dietary_classification": ["vegetarian", "gluten-free option"],
    "allergens": ["dairy (if yogurt/milk)", "tree nuts (optional)"]
  },
  {
    "id": "104",
    "text": "Zucchini Noodles with basil pesto and cherry tomatoes, a light, low-carb pasta alternative.",
    "name": "Zoodles with Pesto",
    "category": "Low-Carb Pasta",
    "origin": "Global",
    "region": "Global",
    "type": "Main Course",
  "description": "Spiralized zucchini is briefly sautéed and tossed with basil pesto and burst cherry tomatoes for a summery, low‑carb bowl. Salting and blotting the zoodles first helps reduce excess moisture so the sauce clings. The dish channels pasta’s pleasure while showcasing vegetables and herbs. Add grilled chicken or chickpeas to boost protein, or use walnut pesto and nutritional yeast for a vegan spin. A squeeze of lemon and cracked pepper brighten the herbal richness without extra salt.",
    "ingredients": ["zucchini", "basil", "olive oil", "garlic", "pine nuts", "Parmesan", "lemon", "cherry tomatoes"],
    "method": "Blend pesto; sauté zoodles briefly to retain crunch; toss with pesto and warmed tomatoes.",
    "nutrition": "Low in carbohydrates and calories; rich in vitamin K from basil and zucchini; heart-healthy fats from olive oil and nuts.",
    "cultural_significance": "Embodies the vegetable-forward, low-carb trend in modern home cooking.",
    "regional_variations": "Use walnut or almond pesto; swap Parmesan for nutritional yeast for a vegan version.",
    "dietary_classification": ["vegetarian", "low-carb", "gluten-free"],
    "allergens": ["tree nuts", "dairy"]
  },
  {
    "id": "105",
    "text": "Classic Mac and Cheese baked with a creamy cheddar sauce and a crisp breadcrumb topping.",
    "name": "Classic Mac & Cheese",
    "category": "Comfort Bake",
    "origin": "United States",
    "region": "USA",
    "type": "Main Course",
  "description": "Mac and cheese is the quintessential American comfort bake: elbow macaroni cloaked in a velvety cheddar béchamel, sometimes blended with Gruyère or Colby for depth, then topped with buttery crumbs. Bubbly and golden from the oven, it recalls potlucks, holiday spreads, and cozy weeknights. A steady roux and warm milk prevent lumps, while a brief bake preserves creaminess. Stirring in a little hot sauce or dry mustard perks up flavor; broiling briefly crisps the top.",
    "ingredients": ["macaroni", "cheddar", "milk", "butter", "flour", "mustard powder", "breadcrumbs"],
    "method": "Cook pasta; make a roux and whisk in milk and cheese; combine, top with breadcrumbs, and bake until bubbly.",
    "nutrition": "High in calcium and energy; can be lightened with whole-wheat pasta and added vegetables.",
    "cultural_significance": "A staple at American gatherings from school lunches to Thanksgiving sides, evoking childhood and community.",
    "regional_variations": "Southern versions often use evaporated milk and multiple cheeses; stovetop versions skip baking.",
    "dietary_classification": ["vegetarian"],
    "allergens": ["gluten", "dairy"]
  },
  {
    "id": "106",
    "text": "Shepherd’s Pie with savory minced lamb and vegetables under a buttery mashed potato crust.",
    "name": "Shepherd’s Pie",
    "category": "Comfort Casserole",
    "origin": "Ireland/United Kingdom",
    "region": "British Isles",
    "type": "Main Course",
  "description": "Shepherd’s Pie layers savory minced lamb and vegetables beneath a plush mashed potato crust, baked until lightly browned. Browning the meat deeply and reducing the gravy concentrates flavor, while the potato lid traps steam and keeps the filling luscious. A thrifty classic of British and Irish home cooking, it turns leftovers into comfort and pairs naturally with peas or a crisp salad. Dotting the mash with butter before baking encourages browning and a lightly crisp ripple.",
    "ingredients": ["ground lamb", "onion", "carrot", "peas", "tomato paste", "Worcestershire sauce", "thyme", "potatoes", "butter", "milk"],
    "method": "Brown lamb with aromatics; simmer with tomato paste and stock; top with mashed potatoes and bake until golden.",
    "nutrition": "Provides iron and protein; potatoes supply potassium and vitamin C; can be balanced with a green salad.",
    "cultural_significance": "A classic of British comfort cuisine, born from using leftovers to create a satisfying family meal.",
    "regional_variations": "Cottage Pie uses beef; some versions add cheddar to the mash or parsnips to the base.",
    "dietary_classification": ["non-vegetarian"],
    "allergens": ["dairy"]
  },
  {
    "id": "107",
    "text": "Chinese Congee with ginger and scallions, a soothing rice porridge served with simple toppings.",
    "name": "Ginger-Scallion Congee",
    "category": "Comfort Porridge",
    "origin": "China",
    "region": "East Asia",
    "type": "Breakfast/Soup",
  "description": "Congee is a slow-cooked rice porridge prized across East Asia for its soothing texture and digestibility. Simmered with plenty of water or stock until grains break down, it becomes creamy without dairy. Ginger, scallions, and white pepper lend gentle warmth; toppings—from pickles to shredded chicken and century egg—add variety. Breakfast staple and convalescent standby, it’s comfort in a bowl and a canvas for family traditions. A drizzle of sesame oil or soy can add fragrance and depth.",
    "ingredients": ["rice", "water or stock", "ginger", "scallions", "white pepper", "salt"],
    "method": "Simmer rice with liquid until very soft, stirring occasionally; season lightly and garnish.",
    "nutrition": "Easy on digestion; hydration and electrolytes from broth; can be enriched with protein and vegetables.",
    "cultural_significance": "A daily breakfast and convalescence food across Chinese households, symbolizing care and simplicity.",
    "regional_variations": "Cantonese jook is very smooth; Teochew muay is looser; toppings vary widely by region.",
    "dietary_classification": ["vegetarian option", "gluten-free"],
    "allergens": []
  },
  {
    "id": "108",
    "text": "Brazilian Feijoada, a black bean and pork stew slow-cooked to deep, smoky richness.",
    "name": "Feijoada",
    "category": "Comfort Stew",
    "origin": "Brazil",
    "region": "Brazil",
    "type": "Main Course",
  "description": "Feijoada is Brazil’s beloved Saturday stew: black beans simmered with pork shoulder, linguiça, and sometimes ribs until velvety and aromatic. Served with rice, farofa (toasted cassava flour), orange slices, and garlicky greens, it’s hearty, communal, and rhythmically paced. The bright sides cut through richness, while the beans’ smoky depth lingers. Families argue about cuts and seasonings the way only classics inspire. Cold next-day feijoada thickens beautifully and makes an especially satisfying lunch, especially with extra orange to refresh the palate.",
    "ingredients": ["black beans", "pork shoulder", "linguiça sausage", "onion", "garlic", "bay leaf", "orange", "collard greens", "farofa"],
    "method": "Soak beans; simmer with pork and aromatics until tender; serve with rice, farofa, orange slices, and greens.",
    "nutrition": "High in protein and iron; beans provide fiber and folate; sides add vitamin C and phytonutrients.",
    "cultural_significance": "A weekend ritual across Brazil, associated with family gatherings and samba.",
    "regional_variations": "Cuts of pork vary; lighter versions use fewer cured meats; vegetarian feijoada swaps mushrooms for meat.",
    "dietary_classification": ["non-vegetarian", "gluten-free"],
    "allergens": []
  },
  {
    "id": "109",
    "text": "Chicken Noodle Soup with clear broth, vegetables, and tender shredded chicken—a classic restorative dish.",
    "name": "Chicken Noodle Soup",
    "category": "Comfort Soup",
    "origin": "Global/Ashkenazi Influence",
    "region": "Global",
    "type": "Soup",
  "description": "This timeless soup simmers chicken with carrots, celery, onion, and herbs to build a clean, savory broth. Skimming foam keeps flavors pure; finishing with fresh dill or parsley adds lift. Noodles make it satisfying without weight. Served steaming hot, it’s synonymous with care and recovery, the bowl delivered when words fall short and warmth is the better medicine. A splash of lemon or gingered stock tilts it toward Mediterranean or East Asian comfort, bridging cultures through a singular idea of warmth.",
    "ingredients": ["chicken", "onion", "carrot", "celery", "garlic", "bay leaf", "noodles", "dill or parsley"],
    "method": "Simmer chicken and aromatics for broth; strain, shred chicken, and cook noodles in the broth. Finish with herbs.",
    "nutrition": "Hydrating and easy to digest; protein supports recovery; vegetables contribute vitamins and minerals.",
    "cultural_significance": "Known as ‘Jewish penicillin’ in some communities, it’s a universal comfort across cultures.",
    "regional_variations": "Matzo balls or dumplings can replace noodles; Asian versions use rice noodles and ginger.",
    "dietary_classification": ["non-vegetarian"],
    "allergens": ["gluten (noodles)"]
  },
  {
    "id": "110",
    "text": "Indian Khichdi of rice and lentils gently spiced and cooked to a soft, soothing consistency.",
    "name": "Khichdi",
    "category": "Comfort Porridge",
    "origin": "India",
    "region": "India",
    "type": "Main Course",
  "description": "Khichdi is a humble, nourishing blend of rice and lentils cooked until soft, scented with turmeric, cumin, and ginger. A spoon of ghee adds roundness while peas or carrots lend sweetness. Celebrated in Ayurveda for being sattvic and gentle, it soothes the stomach yet sustains, especially with yogurt or pickle alongside. Pressure cookers make it weeknight-fast, and a crackling cumin tadka on top turns simple into special. On rainy evenings, few bowls feel as restorative and grounding.",
    "ingredients": ["rice", "moong dal (lentils)", "turmeric", "cumin", "ginger", "ghee or oil", "peas", "salt"],
    "method": "Rinse and cook rice and lentils together with spices until creamy; finish with a tempered tadka of cumin in ghee.",
    "nutrition": "Complete protein profile when paired with yogurt; provides fiber, B vitamins, and gentle energy.",
    "cultural_significance": "Synonymous with comfort and simplicity in Indian homes; often the first ‘solid’ for children.",
    "regional_variations": "Gujarati versions are looser; Bengali versions include vegetables; some add whole spices like cloves.",
    "dietary_classification": ["vegetarian", "gluten-free"],
    "allergens": ["dairy (ghee, optional)"]
  }
]
